posts/2025-05-16-css-selectors.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>CSS Selectors</title>
<meta name="description" content="CSS selectors are used to &quot;find&quot; (or select) the HTML elements you want to style.">
<meta name="keywords" content="Web, CSS">
<meta name="generator" content="Org Mode">
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png">
<link rel="manifest" href="/site.webmanifest">
<link rel="stylesheet" type="text/css" href="/css/main.bundle.min.css">
</head>
<body>
<header id="preamble" class="status">
<div class="site-header">
  <a class="site-title" href="/">Chuck</a>
  <div class="site-nav">
    <div id="menu-list" class="main-menu">
      <a href="/posts/">Posts</a>
      <a href="/about.html">About</a>
    </div>
    <button aria-label="Search" onclick="window.location.href='/search.html';">
      <svg width="20" height="20" viewBox="0 0 24 24">
        <path fill="currentcolor" d="M23.822 20.88l-6.353-6.354c.93-1.465 1.467-3.2 1.467-5.059.001-5.219-4.247-9.467-9.468-9.467s-9.468 4.248-9.468 9.468c0 5.221 4.247 9.469 9.468 9.469 1.768 0 3.421-.487 4.839-1.333l6.396 6.396 3.119-3.12zm-20.294-11.412c0-3.273 2.665-5.938 5.939-5.938 3.275 0 5.94 2.664 5.94 5.938 0 3.275-2.665 5.939-5.94 5.939-3.274 0-5.939-2.664-5.939-5.939z"></path>
      </svg>
    </button>
    <button id="appearance-switcher" aria-label="Appearance Switcher">
      <svg id="moon" width="20" height="20" viewBox="0 0 512 512">
        <path fill="currentcolor" d="M32 256C32 132.2 132.3 32 255.8 32c11.36.0 29.7 1.668 40.9 3.746 9.616 1.777 11.75 14.63 3.279 19.44C245 86.5 211.2 144.6 211.2 207.8c0 109.7 99.71 193 208.3 172.3 9.561-1.805 16.28 9.324 10.11 16.95C387.9 448.6 324.8 480 255.8 480 132.1 480 32 379.6 32 256z">
        </path>
      </svg>
      <svg id="sun" width="20" height="20" viewBox="0 0 512 512">
        <path fill="currentcolor" d="M256 159.1c-53.02.0-95.1 42.98-95.1 95.1s41.2 96.9 95.1 96.9 95.1-42.98 95.1-95.1S309 159.1 256 159.1zM509.3 347l-63.2-91.9 63.15-91.01c6.332-9.125 1.104-21.74-9.826-23.72l-109-19.7-19.7-109c-1.975-10.93-14.59-16.16-23.72-9.824L256 65.89 164.1 2.736c-9.125-6.332-21.74-1.107-23.72 9.824L121.6 121.6 12.56 141.3C1.633 143.2-3.596 155.9 2.736 164.1L65.89 256 2.74 347.01c-6.332 9.125-1.105 21.74 9.824 23.72l109 19.7 19.7 109c1.975 10.93 14.59 16.16 23.72 9.824L256 446.1l91.01 63.15c9.127 6.334 21.75 1.107 23.72-9.822l19.7-109 109-19.7C510.4 368.8 515.6 356.1 509.3 347zM256 383.1c-70.69.0-127.1-57.31-127.1-127.1.0-70.69 57.31-127.1 127.1-127.1S383.1 186.2 383.1 256c0 70.7-56.4 127.1-127.1 127.1z">
        </path>
      </svg>
    </button>
    <button id="menu-button" aria-label="Menu">
      <svg width="20" height="20" viewBox="0 0 448 512">
        <path fill="currentcolor" d="M0 96C0 78.33 14.33 64 32 64H416c17.7.0 32 14.33 32 32 0 17.7-14.3 32-32 32H32C14.33 128 0 113.7.0 96zM0 256c0-17.7 14.33-32 32-32H416c17.7.0 32 14.3 32 32s-14.3 32-32 32H32c-17.67.0-32-14.3-32-32zM416 448H32c-17.67.0-32-14.3-32-32s14.33-32 32-32H416c17.7.0 32 14.3 32 32s-14.3 32-32 32z">
        </path>
      </svg>
    </button>
  </div>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">CSS Selectors</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#css-simple-selectors">CSS Simple Selectors</a></li>
<li><a href="#css-attribute-selectors">CSS Attribute Selectors</a></li>
<li><a href="#css-nesting-selector">CSS Nesting Selector</a></li>
</ul>
</div>
</nav>
<p>
CSS selectors are used to "find" (or select) the HTML elements you want to style.
</p>
<section id="outline-container-css-simple-selectors" class="outline-2">
<h2 id="css-simple-selectors">CSS Simple Selectors</h2>
<div class="outline-text-2" id="text-css-simple-selectors">
<p>
The simple selectors select elements based on element-name, id, and class. In addition, there is the universal selector (*).
</p>

<table>


<colgroup>
<col class="org-left">

<col class="org-left">

<col class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Selector</th>
<th scope="col" class="org-left">Example</th>
<th scope="col" class="org-left">Example description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">element</td>
<td class="org-left">p</td>
<td class="org-left">Selects all &lt;p&gt; elements</td>
</tr>

<tr>
<td class="org-left">#id</td>
<td class="org-left">#firstname</td>
<td class="org-left">Selects the element with id="firstname"</td>
</tr>

<tr>
<td class="org-left">*</td>
<td class="org-left">*</td>
<td class="org-left">Selects all elements</td>
</tr>

<tr>
<td class="org-left">.class</td>
<td class="org-left">.intro</td>
<td class="org-left">Selects all elements with class="intro"</td>
</tr>
</tbody>
</table>
</div>
</section>
<section id="outline-container-css-attribute-selectors" class="outline-2">
<h2 id="css-attribute-selectors">CSS Attribute Selectors</h2>
<div class="outline-text-2" id="text-css-attribute-selectors">
<p>
The attribute selector selects HTML elements with a given attribute set. 
</p>

<table>


<colgroup>
<col class="org-left">

<col class="org-left">

<col class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Selector</th>
<th scope="col" class="org-left">Example</th>
<th scope="col" class="org-left">Example description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">[attribute]</td>
<td class="org-left">[lang]</td>
<td class="org-left">Selects all elements with a lang attribute</td>
</tr>

<tr>
<td class="org-left">[attribute=value]</td>
<td class="org-left">[lang="it"]</td>
<td class="org-left">Selects all elements with lang="it"</td>
</tr>

<tr>
<td class="org-left">[attribute~=value]</td>
<td class="org-left">[title~="flower"]</td>
<td class="org-left">Selects all elements with a title attribute containing the word "flower"</td>
</tr>

<tr>
<td class="org-left">[attribute&vert;=value]</td>
<td class="org-left">[lang&vert;="en"]</td>
<td class="org-left">Selects all elements with a lang attribute value equal to "en" or starting with "en-"</td>
</tr>

<tr>
<td class="org-left">[attribute^=value]</td>
<td class="org-left">[href^="https"]</td>
<td class="org-left">Selects all elements with a href attribute value that begins with "https"</td>
</tr>

<tr>
<td class="org-left">[attribute$=value]</td>
<td class="org-left">[href$=".pdf"]</td>
<td class="org-left">Selects all elements with a href attribute value ends with ".pdf"</td>
</tr>

<tr>
<td class="org-left">[attribute*=value]</td>
<td class="org-left">[href*="w3schools"]</td>
<td class="org-left">Selects all elements with a href attribute value containing the substring "w3schools"</td>
</tr>
</tbody>
</table>
</div>
</section>
<section id="outline-container-css-nesting-selector" class="outline-2">
<h2 id="css-nesting-selector">CSS Nesting Selector</h2>
<div class="outline-text-2" id="text-css-nesting-selector">
<table>


<colgroup>
<col class="org-left">

<col class="org-left">

<col class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Selector</th>
<th scope="col" class="org-left">Example</th>
<th scope="col" class="org-left">Example description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&amp;</td>
<td class="org-left">&amp;</td>
<td class="org-left">Applies styles for an element within the context of another element</td>
</tr>
</tbody>
</table>
</div>
</section>
</main>
<footer id="postamble" class="status">
<div class="site-footer">
  <p>&copy 2026 Chuck</p>
  <p>Powered by <a href="https://www.gnu.org/software/emacs/">Emacs</a></p>
</div>
<a href="#top" class="top-link" id="top-link" style="visibility: hidden; opacity: 0;">
  <svg xmlns="http://www.w3.org/2000/svg" height="24px" width="24px" viewBox="0 -960 960 960" fill="currentcolor">
    <path d="M440-160v-487L216-423l-56-57 320-320 320 320-56 57-224-224v487h-80Z"></path>
  </svg>
</a>
</footer>
</body>
</html>
